// import Home1 from '../pics/home.jpg'
import { Return } from "./Return.jsx"
import { CreditCard } from "./creditCard.jsx"
import { useEffect } from "react"
import './home.css'
import { useLocation } from 'react-router-dom';
import { useSelector } from "react-redux";
export const Home = () => {
    const location=useLocation();
    const thisUser=useSelector(store=>store.thisUser)
    useEffect(() => {
        //בדיקה האם הכתובת מכילה את ה#RETURN
        //אם כן, מבצעת גלילה ללמטה.
        if (location.hash === '#return') {
            const element = document.getElementById('return');
            debugger
            if (element) {
                element.scrollIntoView({ behavior: 'smooth' });
            }
        }
       
    }, [location]);
    return <>
        <img className='imghome' src={'/pics/home.jpg'}></img>
        <div className="about">
            <h4>השכר, החזיר, חזור על החוויה. בכל מקום. </h4>
            <span> אתנו, השמים הם הגבול. השכר רכב בכל מקום, החזיר אותו בכל מקום, ותיהנה מחופש הנהיגה המוחלט. הגמישות שלנו מאפשרת לך לנסוע למרחקים ארוכים או לחקור את הסביבה הקרובה, בקצב שלך ובזמן שלך.</span>
            <p>חופש הנהיגה שלך מתחיל כאן</p>
            <ul><li>גמישות מוחלטת: השכר והחזר בכל תחנה</li>
                <li>מגוון רכבים: בחר את הרכב המושלם עבורך</li>
                <li>טכנולוגיה מתקדמת: אפליקציה קלה ונוחה לשימוש</li>
            </ul>
        </div>

        <div className="about about1">
            {/* <img src="/pics/לרקע.png"></img> */}
            <p>עסקים נוסעים אתנו
            </p>
            בנוחות, דייקנות, מקצועיות ובשירות מפנק
            ברמה אחת מעל כולם. משדה התעופה ואליו -
            כאן ובכל מקום בארץ - סביב השעון - לשירותכם.
        </div>
        <div className="about about3">
            {/* <img src="/pics/לרקע.png"></img> */}
            <p>דוחפים את הגבול
            </p>
            אצלנו, אנו מאמינים שהנהיגה היא יותר מאשר רק הגעה מנקודה א' לנקודה ב'. זהו חלום, הרפתקה, ביטוי עצמי. אנו מציעים לך את האפשרות לחוות את הנהיגה האולטימטיבית, עם מגוון כלי רכב-על יוקרתיים שיעוררו את הדופק שלך.
        </div>
        <div className="about about2">
            {/* <img src="/pics/לרקע.png"></img> */}
            <p>שירות VIP בנתב"ג
            </p>
            טל לימוזין נתב"ג זו הדרך להבטיח התנהלות חלקה,
            נעימה ומקוצרת בכניסה וביציאה מהארץ.

            הצוות שלנו משרת אתכם מרגע הגעתכם לנקודת המפגש
            בשדה התעופה ומטפל במזוודות, בידוק בטחוני, בידוק הכבודה,
            ביקורת הדרכונים, אירוח בטרקליני אח"מים ועד ...למטוס ובחזרה.
        </div>

        <div className="about" id="aboutInformation">
            <h2>אודותינו
            </h2>
            אנחנו ב"חופש על גלגלים" מאמינים שהחופש לנוע הוא זכות בסיסית. לכן, יצרנו פלטפורמה חדשנית המאפשרת לך לשכור רכב בכל מקום ובכל זמן, ולהחזירו בכל תחנה מורשית ברחבי הארץ.
            הכל התחיל מחלום פשוט: להפוך את הנסיעה לחוויה גמישה ונוחה יותר. רצינו ליצור פתרון שיאפשר לאנשים לחקור את הארץ בקצב שלהם, ללא הגבלות של חברות השכרת הרכב המסורתיות.
            החזון שלנו הוא להיות המובילים בתחום הניידות הגמישה בישראל, ולהעניק לכל אחד את האפשרות לחוות את החופש על הכביש.
            <h3>מה שהופך אותנו למיוחדים:</h3><ul> 
                <li>גמישות מוחלטת: השכר והחזר בכל תחנה</li>
                <li>מגוון רכבים: בחר את הרכב המושלם עבורך</li>
                <li>טכנולוגיה מתקדמת: אפליקציה קלה ונוחה לשימוש</li>
                <li>שירות לקוחות מעולה: תמיד זמינים לעזור</li>
            </ul></div>
            {thisUser&&<div id="return"><h1>החזרת רכב </h1>
        <Return></Return></div>}

    </>

}